first_routes_and_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "stilldeleteit"], ["updated_at", "2023-02-16 20:08:45.705057"], ["id", 6]]
---
    def update
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 6]]
---
    def destroy
        @artwork = Artwork.find(params[:id])
        if @artwork.destroy