first_routes_and_controllers/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]
---
  def destroy
    @artwork_share = ArtworkShare.find(params[:id])
    if @artwork_share.destroy