first_routes_and_controllers/app/models/artwork.rb

SELECT "artworks".* FROM "artworks" WHERE (artist_id = 2)
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (2 = viewer_id)
---
  def self.artworks_for_user_id(user_id)
    owned_art = Artwork
        .where("artist_id = #{user_id}")

    viewed_art = Artwork
        .joins(:artwork_shares)
        .where("#{user_id} = viewer_id")